/*
Localizations.strings
NovaFoundation

Created by Logan Collins on 6/22/16.
Copyright © 2016 Panic Inc. All rights reserved.
*/


// General
"None" = "なし";


// Clips
"Editor" = "エディタ";
"Terminal" = "ターミナル";
"Plain Text" = "標準テキスト";

"SELECTED_TEXT" = "選択されたテキスト";
"DATE" = "日付";
"FILENAME" = "ファイル名";
"FILE_PATH" = "ファイルパス";
"PARENT_FOLDER" = "親フォルダ";
"WORKSPACE_NAME" = "プロジェクト名";
"AUTHOR_NAME" = "所有者名";
"SCM_REVISION" = "SCMリビジョン";
"PREVIOUS_TEXT" = "前のテキスト";
"PASTEBOARD_TEXT" = "ペーストボードテキスト";


// Keyboard
"Space" = "Space";
"Insert" = "Insert";
"Clear" = "Clear";
"Help" = "Help";


// Extensions
"The extension “%@” was not found." = "機能拡張 “%@” は見つかりませんでした。";
"The extension “%@” experienced an error." = "機能拡張 “%@” でエラーが発生しました。";
"The extension “%@” could not be loaded because it requires %@ %@ or later." = "機能拡張 “%@” は読み込まれませんでした。%@ %@ 以降が必要です。";

"No command found with the name “%@”." = "名前 “%@” のコマンドは見つかりませんでした。";
"Check to make sure the extension for the command is installed and up to date." = "コマンドの機能拡張がインストールされ、最新であることをご確認ください。";

"No assistant found with the name “%@”." = "名前 “%@” のアシスタントは見つかりませんでした。";
"Check to make sure the extension for the assistant is installed and up to date." = "アシスタントの機能拡張がインストールされ、最新であることをご確認ください。";

"The extension “%@” is already installed." = "機能拡張 “%@” が既にインストールされています。";
"If you would like to modify the provided extension, copy it outside of the extensions container directory and open it as a workspace." = "提供された機能拡張を変更する際は、機能拡張コンテナディレクトリ外にコピーし、ワークスペースとして開いてください。";

"An extension with the identifier “%@” is already installed." = "識別子 “%@” の機能拡張が既にインストールされています。";
"The version being installed is either older or not compatible. Remove the existing extension before attempting to install another." = "インストールされているバージョンは古いか互換性がありません。別の機能拡張をインストールする前に、既存の機能拡張を削除してください。";

"Could not locate the extension in the unarchived package." = "非アーカイブパッケージで機能拡張が見つかりませんでした。";
"The extension download server returned an unexpected status code (%d)." = "機能拡張ダウンロードサーバが予期しないステータスコード (%d) を返しました。";
"An error was returned from the Extension Library." = "機能拡張ライブラリからエラーが返されました。";

"Authentication failed." = "認証に失敗しました。";

"ExtensionCategoryName_clips" = "クリップ";
"ExtensionCategoryName_commands" = "コマンド";
"ExtensionCategoryName_completions" = "コード補完";
"ExtensionCategoryName_debuggers" = "デバッガ";
"ExtensionCategoryName_formatters" = "整形ツール";
"ExtensionCategoryName_issues" = "バリデータ";
"ExtensionCategoryName_key-bindings" = "キーバインド";
"ExtensionCategoryName_languages" = "言語モード";
"ExtensionCategoryName_tasks" = "タスク";
"ExtensionCategoryName_sidebars" = "サイドバー";
"ExtensionCategoryName_themes" = "テーマ";


// Extension Validation
"No extension logo image found." = "機能拡張のロゴ画像が見つかりません。";
"A primary image is required named \"extension.png\" at the root of the extension bundle." = "名前を \"extension.png\" としたプライマリ画像が、機能拡張バンドルのルートに必要です。";

"Extension primary image too large." = "プライマリ画像が大きすぎます。";
"The extension's primary image should not be larger than 512px." = "機能拡張のプライマリ画像は 512px以下である必要があります。";

"No extension name specified." = "機能拡張名がありません。";
"A user-readable name must be specified for the extension." = "機能拡張にはユーザが読み取り可能な名前を指定する必要があります。";

"No extension description specified." = "機能拡張の説明がありません。";
"Providing a description helps to illustrate the usefulness of your extension to users." = "機能拡張の有用性をユーザに知らせるための説明を提供してください。";

"Invalid version number specified." = "バージョン番号が正しくありません。";
"Version numbers for extensions should follow a scheme such as \"xx.yy.zz\"." = "バージョン番号は \"xx.yy.zz\ スタイルに沿ったものである必要があります。";

"Version number is the same or older." = "バージョン番号が同じか、古いです。";
"The updated extension version number is the same or older than the currently published version. Bump your extension's version number to submit an update." = "更新された機能拡張のバージョンが公開中のものと同じか、古いです。バージョン番号をバンプして提出してください。";

"No organization specified." = "ベンダー名がありません。";
"A user-readable organization name must be specified for the extension." = "機能拡張にはユーザが読み取り可能なベンダー名を指定する必要があります。";

"The \"author\" metadata key is no longer supported." = "\"author\" メタデータキーは推奨しません";
"Use of the \"author\" key should be replaced with the \"organization\" key instead." = "\"author\" キーの使用は \"organization\" キーに置き換える必要があります。";

"The \"vendor\" metadata key is no longer supported." = "\"vendor\" メタデータキーは推奨しません";
"Use of the \"vendor\" key should be replaced with the \"organization\" key instead." = "\"vendor\" キーの使用は \"organization\" キーに置き換える必要があります。";

"No extension activation events specified." = "機能拡張アクティブ化イベントが指定されていません。";
"One or more activation events must be specified for extensions that include scripts." = "スクリプトを含む機能拡張には、1つ以上のアクティブ化イベントを指定する必要があります。";

"No extension categories specified." = "カテゴリが指定されていません。";
"Specifying categories helps users to find your extension in the library." = "カテゴリを指定することで、ユーザがあなたの機能拡張を見つけるのに役立ちます。";

"Invalid extension category: \"%@\"." = "無効な機能拡張カテゴリ \"%@\" です。";
"Ensure that the category identifiers you have specified exactly match those available in the documentation." = "指定したカテゴリ識別子が利用可能なものと正確に一致しているかをご確認ください。";

"Missing components for category: \"%@\"." = "カテゴリのコンポーネント \"%@\" が見つかりません。";
"Extensions using the Clips category must include at least one set of clips for the Clips sidebar." = "クリップカテゴリの機能拡張は、1つ以上のクリップが含まれている必要があります。";
"Extensions using the Commands category must include at least one command" = "コマンドカテゴリの機能拡張は、1つ以上のコマンドが含まれている必要があります。";
"Extensions using the Key Bindings category must include at least one key binding set." = "キーバインドカテゴリの機能拡張は、1つ以上のキーバインドセットが含まれている必要があります。";
"Extensions using the Sidebars category must include at least one sidebar definition." = "サイドバーカテゴリの機能拡張は、1つ以上のサイドバー定義が含まれている必要があります。";
"Extensions using the Tasks category must include at least one task configuration template definition." = "タスクカテゴリの機能拡張は、1つ以上のタスク構成テンプレート定義が含まれている必要があります。";
"Extensions using the Themes category must include at least one theme." = "テーマカテゴリの機能拡張は、1つ以上のテーマが含まれている必要があります。";

"A main script was specified but not found." = "指定されているメインスクリプトが見つかりません。";
"The extension specifies a main script named “%@”, but the file could not be read. Check to ensure this file exists within the extension's \"Scripts/\" folder." = "この機能拡張はメインスクリプトとして “%@” が指定されていますが読み込めませんでした。このファイルが機能拡張の \"Scripts/\" フォルダ内に存在していることをご確認ください。";

"No bug reporting link specified." = "バグレポートリンクが指定されていません。";
"Specifying a bug reporting link helps users to submit issues related to your extension. Specify a URL and / or email address using the \"bugs\" key in your extension's manifest." = "バグレポートリンクはユーザがあなたの機能拡張を利用する上で起こった問題の報告に役立ちます。\"bugs\" キーを利用してレポート先のURLかメールアドレスのどちらか、もしくはその両方を指定してください。";

"No Readme found." = "リードミーか見つかりません。";
"A README.md file is required. Place this file in the root of the extension." = "ユーザに初めに読んでもらう書類 README.md が必要です。機能拡張のルートに配置してください。";

"No Change Log found." = "変更履歴が見つかりません。";
"A CHANGELOG.md file is required. Place this file in the root of the extension." = "変更履歴を記載した書類 CHANGELOG.md が必要です。機能拡張のルートに配置してください。";

"Missing architectures in grammar library." = "文法ライブラリにアーキテクチャがありません。";
"The grammar \"%@\" is missing one or more required architectures: (%@)." = "文法 \"%@\" には1つ以上のアーキテクチャが必要です: (%@)";

"Invalid code signature for grammar library." = "文法ライブラリのコード署名が無効です。";
"The grammar \"%@\" does not have a valid code signature: %@." = "文法 \"%@\" には有効なコード署名が必要です: (%@)";
